Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# ai.assistant.chat.copyAll.tooltip
source: Copy full chat as Markdown to clipboard
ar: نسخ الدردشة كاملة بصيغة Markdown إلى الحافظة
de: Kompletten Chat als Markdown in die Zwischenablage kopieren
es: Copiar el chat completo como Markdown al portapapeles
fr: Copier tout le chat en Markdown dans le presse-papiers
id: Salin seluruh chat sebagai Markdown ke papan klip
it: Copia l'intera chat come Markdown negli appunti
ja: チャット全体をMarkdownとしてクリップボードにコピー
ko: 전체 채팅을 마크다운으로 클립보드에 복사
nl: Kopieer volledige chat als Markdown naar klembord
pl: Kopiuj cały czat jako Markdown do schowka
pt_br: Copiar chat completo como Markdown para a área de transferência
ru: Копировать весь чат в Markdown в буфер обмена
tr: Sohbetin tamamını Markdown olarak panoya kopyala
uk: Копіювати весь чат у форматі Markdown у буфер обміну
vi: Sao chép toàn bộ trò chuyện dưới dạng Markdown vào bảng tạm
zh_hans: 复制全部对话为 Markdown 到剪贴板
zh_hant: 將完整對話複製為 Markdown 到剪貼簿

# ai.assistant.chat.copyQuestion.tooltip
source: Copy this question to clipboard
ar: نسخ هذا السؤال إلى الحافظة
de: Diese Frage in die Zwischenablage kopieren
es: Copiar esta pregunta al portapapeles
fr: Copier cette question dans le presse-papiers
id: Salin pertanyaan ini ke papan klip
it: Copia questa domanda negli appunti
ja: この質問をクリップボードにコピー
ko: 이 질문을 클립보드에 복사
nl: Kopieer deze vraag naar klembord
pl: Kopiuj to pytanie do schowka
pt_br: Copiar esta pergunta para a área de transferência
ru: Копировать этот вопрос в буфер обмена
tr: Bu soruyu panoya kopyala
uk: Копіювати це запитання в буфер обміну
vi: Sao chép câu hỏi này vào bảng tạm
zh_hans: 复制此问题到剪贴板
zh_hant: 將此問題複製到剪貼簿

# ai.assistant.chat.copyReply.tooltip
source: Copy this reply Markdown to clipboard
ar: نسخ هذا الرد بصيغة Markdown إلى الحافظة
de: Diese Antwort als Markdown in die Zwischenablage kopieren
es: Copiar esta respuesta como Markdown al portapapeles
fr: Copier cette réponse en Markdown dans le presse-papiers
id: Salin balasan Markdown ini ke papan klip
it: Copia il Markdown di questa risposta negli appunti
ja: この返信のMarkdownをクリップボードにコピー
ko: 이 답변 마크다운을 클립보드에 복사
nl: Kopieer dit antwoord (Markdown) naar klembord
pl: Kopiuj tę odpowiedź Markdown do schowka
pt_br: Copiar Markdown desta resposta para a área de transferência
ru: Копировать этот ответ в Markdown в буфер обмена
tr: Bu yanıtı Markdown olarak panoya kopyala
uk: Копіювати цю відповідь у форматі Markdown у буфер обміну
vi: Sao chép câu trả lời này dưới dạng Markdown vào bảng tạm
zh_hans: 复制此回复 Markdown 到剪贴板
zh_hant: 將此回覆 Markdown 複製到剪貼簿

# ai.assistant.chat.editQuestion.tooltip
source: Edit this question in the input field
ar: تعديل هذا السؤال في حقل الإدخال
de: Diese Frage im Eingabefeld bearbeiten
es: Editar esta pregunta en el campo de entrada
fr: Modifier cette question dans le champ de saisie
id: Edit pertanyaan ini di kolom input
it: Modifica questa domanda nel campo di input
ja: この質問を入力フィールドで編集
ko: 입력 필드에서 이 질문 수정
nl: Bewerk deze vraag in het invoerveld
pl: Edytuj to pytanie w polu wprowadzania
pt_br: Editar esta pergunta no campo de entrada
ru: Редактировать этот вопрос в поле ввода
tr: Bu soruyu giriş alanında düzenle
uk: Редагувати це запитання в полі введення
vi: Chỉnh sửa câu hỏi này trong trường nhập
zh_hans: 在输入框中修改此问题
zh_hant: 在輸入欄位中編輯此問題

# ai.assistant.chat.empty.description
source: AI has loaded this repo's metadata and README; ask about use cases, alternatives, source-code clues, and more.
ar: قام الذكاء الاصطناعي بتحميل بيانات هذا المستودع وملف README؛ اسأل عن حالات الاستخدام، البدائل، أدلة الكود المصدري، والمزيد.
de: KI hat die Metadaten und README dieses Repositorys geladen; fragen Sie nach Anwendungsfällen, Alternativen, Quellcode-Hinweisen und mehr.
es: La IA ha cargado los metadatos y el README de este repositorio; pregunta sobre casos de uso, alternativas, pistas en el código fuente y más.
fr: L'IA a chargé les métadonnées et le README de ce dépôt ; posez des questions sur les cas d'usage, les alternatives, les indices dans le code source, etc.
id: AI telah memuat metadata dan README repo ini; tanyakan tentang kasus penggunaan, alternatif, petunjuk kode sumber, dan lainnya.
it: L'IA ha caricato i metadati e il README di questo repository; chiedi informazioni su casi d'uso, alternative, indizi nel codice sorgente e altro.
ja: AIがこのリポジトリのメタデータとREADMEを読み込みました。ユースケース、代替案、ソースコードの手がかりなどについて質問できます。
ko: AI가 이 저장소의 메타데이터와 README를 로드했습니다. 사용 사례, 대안, 소스 코드 단서 등에 대해 물어보세요.
nl: AI heeft de metadata en README van deze repo geladen; vraag naar use cases, alternatieven, broncode-aanwijzingen en meer.
pl: AI załadowało metadane i plik README tego repozytorium; pytaj o przypadki użycia, alternatywy, wskazówki w kodzie źródłowym i więcej.
pt_br: A IA carregou os metadados e o README deste repositório; pergunte sobre casos de uso, alternativas, pistas no código-fonte e mais.
ru: ИИ загрузил метаданные и README этого репозитория; спрашивайте о вариантах использования, альтернативах, подсказках в исходном коде и многом другом.
tr: AI, bu deponun meta verilerini ve README dosyasını yükledi; kullanım senaryoları, alternatifler, kaynak kod ipuçları ve daha fazlası hakkında sorun.
uk: ШІ завантажив метадані та README цього репозиторію; запитуйте про варіанти використання, альтернативи, підказки у вихідному коді тощо.
vi: AI đã tải siêu dữ liệu và README của repo này; hãy hỏi về trường hợp sử dụng, lựa chọn thay thế, manh mối mã nguồn, v.v.
zh_hans: AI 已带上仓库元数据与 README 上下文；你可以追问适用场景、对比方案、读源码线索等。
zh_hant: AI 已載入此儲存庫的中繼資料和 README；您可以詢問使用案例、替代方案、原始碼線索等。

# ai.assistant.chat.empty.title
source: Start chatting with AI about this repo
ar: ابدأ الدردشة مع الذكاء الاصطناعي حول هذا المستودع
de: Chatten Sie mit KI über dieses Repository
es: Empieza a chatear con la IA sobre este repositorio
fr: Commencez à discuter avec l'IA à propos de ce dépôt
id: Mulai chat dengan AI tentang repo ini
it: Inizia a chattare con l'IA su questo repository
ja: このリポジトリについてAIとチャットを開始
ko: 이 저장소에 대해 AI와 채팅 시작
nl: Begin met chatten met AI over deze repo
pl: Rozpocznij czat z AI o tym repozytorium
pt_br: Comece a conversar com a IA sobre este repositório
ru: Начните чат с ИИ об этом репозитории
tr: Bu depo hakkında AI ile sohbet etmeye başlayın
uk: Почніть чат із ШІ про цей репозиторій
vi: Bắt đầu trò chuyện với AI về repo này
zh_hans: 开始与 AI 聊聊这个仓库
zh_hant: 開始與 AI 討論此儲存庫

# ai.assistant.chat.export.docTitleFormat
source: Starcat AI Chat · %@
ar: دردشة Starcat AI · %@
es: Chat de Starcat AI · %@
it: Chat Starcat AI · %@
ja: Starcat AI チャット · %@
ko: Starcat AI 채팅 · %@
ru: Чат Starcat AI · %@
tr: Starcat AI Sohbet · %@
uk: Starcat AI Чат · %@
vi: Trò chuyện AI Starcat · %@
zh_hans: Starcat AI 对话 · %@
zh_hant: Starcat AI 對話 · %@

# ai.assistant.chat.export.emptyContent
source: _(no content)_
ar: _(لا يوجد محتوى)_
de: _(kein Inhalt)_
es: _(sin contenido)_
fr: _(aucun contenu)_
id: _(tidak ada konten)_
it: _(nessun contenuto)_
ja: _(コンテンツなし)_
ko: _(내용 없음)_
nl: _(geen inhoud)_
pl: _(brak treści)_
pt_br: _(sem conteúdo)_
ru: _(нет содержимого)_
tr: _(içerik yok)_
uk: _(немає вмісту)_
vi: _(không có nội dung)_
zh_hans: _（未生成内容）_
zh_hant: _（無內容）_

# ai.assistant.chat.export.exportedAtLabel
source: Exported
ar: تم التصدير
de: Exportiert
es: Exportado
fr: Exporté le
id: Diekspor
it: Esportato
ja: エクスポート日時
ko: 내보냄
nl: Geëxporteerd
pl: Eksportowano
pt_br: Exportado em
ru: Экспортировано
tr: Dışa aktarıldı
uk: Експортовано
vi: Đã xuất
zh_hans: 导出时间
zh_hant: 匯出時間

# ai.assistant.chat.export.generatedByFormat
source: Generated by %@
ar: تم إنشاؤه بواسطة %@
de: Generiert von %@
es: Generado por %@
fr: Généré par %@
id: Dihasilkan oleh %@
it: Generato da %@
ja: %@ によって生成
nl: Gegenereerd door %@
pl: Wygenerowane przez %@
pt_br: Gerado por %@
ru: Создано %@
tr: %@ tarafından oluşturuldu
uk: Створено %@
vi: Được tạo bởi %@
zh_hans: 由 %@ 生成
zh_hant: 由 %@ 生成

# ai.assistant.chat.export.messageCountLabel
source: Messages
ar: الرسائل
de: Nachrichten
es: Mensajes
id: Pesan
it: Messaggi
ja: メッセージ
ko: 메시지
nl: Berichten
pl: Wiadomości
pt_br: Mensagens
ru: Сообщения
tr: Mesajlar
uk: Повідомлення
vi: Tin nhắn
zh_hans: 消息数
zh_hant: 消息數

# ai.assistant.chat.export.repoLabel
source: Repo
ar: المستودع
de: Repository
es: Repositorio
fr: Dépôt
it: Repository
ja: リポジトリ
ko: 저장소
pl: Repozytorium
pt_br: Repositório
ru: Репозиторий
tr: Depo
uk: Репозиторій
zh_hans: 仓库
zh_hant: 倉庫

# ai.assistant.chat.export.userFallback
source: You
ar: أنت
de: Sie
es: Tú
fr: Vous
id: Anda
it: Tu
ja: あなた
ko: 나
nl: Jij
pl: Ty
pt_br: Você
ru: Вы
tr: Siz
uk: Ви
vi: Bạn
zh_hans: 你
zh_hant: 你

# ai.assistant.chat.failureFormat
source: (Generation failed: %@)
ar: (فشل التوليد: %@)
de: (Generierung fehlgeschlagen: %@)
es: (Generación fallida: %@)
fr: (Génération échouée : %@)
id: (Generasi gagal: %@)
it: (Generazione fallita: %@)
ja: （生成に失敗しました: %@）
ko: (생성 실패: %@)
nl: (Generatie mislukt: %@)
pl: (Generowanie nie powiodło się: %@)
pt_br: (Falha na geração: %@)
ru: (Ошибка генерации: %@)
tr: (Oluşturma başarısız: %@)
uk: (Генерація не вдалася: %@)
vi: (Tạo thất bại: %@)
zh_hans: （生成失败：%@）
zh_hant: （生成失敗：%@）

# ai.assistant.chat.history.loadEarlier
source: Load earlier messages
ar: تحميل الرسائل السابقة
de: Frühere Nachrichten laden
es: Cargar mensajes anteriores
fr: Charger les messages précédents
id: Muat pesan sebelumnya
it: Carica messaggi precedenti
ja: 以前のメッセージを読み込む
ko: 이전 메시지 불러오기
nl: Eerdere berichten laden
pl: Wczytaj wcześniejsze wiadomości
pt_br: Carregar mensagens anteriores
ru: Загрузить более ранние сообщения
tr: Önceki mesajları yükle
uk: Завантажити попередні повідомлення
vi: Tải tin nhắn trước đó
zh_hans: 加载更早消息
zh_hant: 載入更早訊息

# ai.assistant.chat.history.loadEarlier.help
source: Load 20 earlier messages from disk
ar: تحميل 20 رسالة سابقة من القرص
de: 20 frühere Nachrichten von der Festplatte laden
es: Cargar 20 mensajes anteriores del disco
fr: Charger 20 messages précédents depuis le disque
id: Muat 20 pesan sebelumnya dari disk
it: Carica 20 messaggi precedenti dal disco
ja: ディスクから20件の以前のメッセージを読み込みます
ko: 디스크에서 이전 메시지 20개 불러오기
nl: Laad 20 eerdere berichten van schijf
pl: Wczytaj 20 wcześniejszych wiadomości z dysku
pt_br: Carregar 20 mensagens anteriores do disco
ru: Загрузить 20 более ранних сообщений с диска
tr: Diskten 20 önceki mesajı yükle
uk: Завантажити 20 попередніх повідомлень з диска
vi: Tải 20 tin nhắn trước đó từ đĩa
zh_hans: 从磁盘再加载 20 条更早的消息
zh_hant: 從磁碟再載入 20 條更早的訊息

# ai.assistant.chat.history.loadingEarlier
source: Loading…
ar: جارٍ التحميل…
de: Lade…
es: Cargando…
fr: Chargement…
id: Memuat…
it: Caricamento…
ja: 読み込み中…
ko: 로딩 중…
nl: Laden…
pl: Wczytywanie…
pt_br: Carregando…
ru: Загрузка…
tr: Yükleniyor…
uk: Завантаження…
vi: Đang tải…
zh_hans: 加载中…
zh_hant: 載入中…

# ai.assistant.chat.processed
source: Processed
ar: تمت المعالجة
de: Verarbeitet
es: Procesado
fr: Traité
id: Diproses
it: Elaborato
ja: 処理済み
ko: 처리됨
nl: Verwerkt
pl: Przetworzono
pt_br: Processado
ru: Обработано
tr: İşlendi
uk: Оброблено
vi: Đã xử lý
zh_hans: 已处理
zh_hant: 已處理

# ai.assistant.chat.processing
source: Processing
ar: جارٍ المعالجة
de: Verarbeite
es: Procesando
fr: Traitement en cours
id: Memproses
it: Elaborazione in corso
ja: 処理中
ko: 처리 중
nl: Verwerken
pl: Przetwarzanie
pt_br: Processando
ru: Обработка
tr: İşleniyor
uk: Обробка
vi: Đang xử lý
zh_hans: 处理中
zh_hant: 處理中

# ai.assistant.chat.reasoning.duration.format
source: %.1f s
ar: %.1f ثانية
id: %.1f dtk
ja: %.1f 秒
ko: %.1f초
ru: %.1f с
uk: %.1f с
zh_hans: %.1f 秒
zh_hant: %.1f 秒

# ai.assistant.chat.reasoning.title
source: Think
ar: تفكير
de: Denken
es: Pensar
fr: Réflexion
id: Pikir
it: Pensiero
ja: 思考
ko: 생각
nl: Denk
pl: Myśl
pt_br: Pensar
ru: Размышление
tr: Düşün
uk: Міркування
vi: Suy nghĩ
zh_hans: 思考
zh_hant: 思考

# ai.assistant.chat.session.clearCurrentRepo
source: Clear all sessions for this repo
ar: مسح جميع الجلسات لهذا المستودع
de: Alle Sitzungen für dieses Repository löschen
es: Borrar todas las sesiones de este repositorio
fr: Effacer toutes les sessions pour ce dépôt
id: Hapus semua sesi untuk repo ini
it: Cancella tutte le sessioni per questo repository
ja: このリポジトリの全セッションを消去
ko: 이 저장소의 모든 세션 지우기
nl: Alle sessies voor deze repo wissen
pl: Wyczyść wszystkie sesje dla tego repozytorium
pt_br: Limpar todas as sessões deste repositório
ru: Очистить все сеансы для этого репозитория
tr: Bu depo için tüm oturumları temizle
uk: Очистити всі сеанси для цього репозиторію
vi: Xóa tất cả phiên cho repo này
zh_hans: 清除当前仓库的全部对话
zh_hant: 清除目前倉庫的全部對話

# ai.assistant.chat.session.clearCurrentRepo.confirm
source: Clear all sessions for this repo?
ar: مسح جميع الجلسات لهذا المستودع؟
de: Alle Sitzungen für dieses Repository löschen?
es: ¿Borrar todas las sesiones de este repositorio?
fr: Effacer toutes les sessions pour ce dépôt ?
id: Hapus semua sesi untuk repo ini?
it: Cancellare tutte le sessioni per questo repository?
ja: このリポジトリの全セッションを消去しますか？
ko: 이 저장소의 모든 세션을 지우시겠습니까?
nl: Alle sessies voor deze repo wissen?
pl: Wyczyścić wszystkie sesje dla tego repozytorium?
pt_br: Limpar todas as sessões deste repositório?
ru: Очистить все сеансы для этого репозитория?
tr: Bu depo için tüm oturumlar temizlensin mi?
uk: Очистити всі сеанси для цього репозиторію?
vi: Xóa tất cả phiên cho repo này?
zh_hans: 清除当前仓库的全部对话？
zh_hant: 清除目前倉庫的全部對話？

# ai.assistant.chat.session.clearCurrentRepo.message
source: All chat sessions for this repository will be permanently removed.
ar: ستتم إزالة جميع جلسات الدردشة لهذا المستودع بشكل دائم.
de: Alle Chat-Sitzungen für dieses Repository werden dauerhaft entfernt.
es: Todas las sesiones de chat de este repositorio se eliminarán permanentemente.
fr: Toutes les sessions de chat pour ce dépôt seront définitivement supprimées.
id: Semua sesi chat untuk repositori ini akan dihapus secara permanen.
it: Tutte le sessioni di chat per questo repository verranno rimosse definitivamente.
ja: このリポジトリのすべてのチャットセッションが完全に削除されます。
ko: 이 저장소의 모든 채팅 세션이 영구적으로 제거됩니다.
nl: Alle chatsessies voor deze repository worden permanent verwijderd.
pl: Wszystkie sesje czatu dla tego repozytorium zostaną trwale usunięte.
pt_br: Todas as sessões de chat deste repositório serão removidas permanentemente.
ru: Все сеансы чата для этого репозитория будут безвозвратно удалены.
tr: Bu depo için tüm sohbet oturumları kalıcı olarak silinecek.
uk: Усі сеанси чату для цього репозиторію буде остаточно видалено.
vi: Tất cả phiên trò chuyện cho repo này sẽ bị xóa vĩnh viễn.
zh_hans: 当前仓库下的所有对话会话将被永久删除，不可恢复。
zh_hant: 目前倉庫下的所有對話將被永久刪除。

# ai.assistant.chat.session.delete.help
source: Delete this session
ar: حذف هذه الجلسة
de: Diese Sitzung löschen
es: Eliminar esta sesión
fr: Supprimer cette session
id: Hapus sesi ini
it: Elimina questa sessione
ja: このセッションを削除
ko: 이 세션 삭제
nl: Verwijder deze sessie
pl: Usuń tę sesję
pt_br: Excluir esta sessão
ru: Удалить этот сеанс
tr: Bu oturumu sil
uk: Видалити цей сеанс
vi: Xóa phiên này
zh_hans: 删除此会话
zh_hant: 刪除此對話

# ai.assistant.chat.session.list.empty
source: No saved sessions for this repo yet.
ar: لا توجد جلسات محفوظة لهذا المستودع بعد.
de: Noch keine gespeicherten Sitzungen für dieses Repository.
es: Aún no hay sesiones guardadas para este repositorio.
fr: Aucune session enregistrée pour ce dépôt pour l'instant.
id: Belum ada sesi tersimpan untuk repo ini.
it: Nessuna sessione salvata per questo repository.
ja: このリポジトリの保存済みセッションはまだありません。
ko: 아직 저장된 세션이 없습니다.
nl: Nog geen opgeslagen sessies voor deze repo.
pl: Brak zapisanych sesji dla tego repozytorium.
pt_br: Nenhuma sessão salva para este repositório ainda.
ru: Сохранённых сеансов для этого репозитория пока нет.
tr: Bu depo için henüz kaydedilmiş oturum yok.
uk: Ще немає збережених сеансів для цього репозиторію.
vi: Chưa có phiên nào được lưu cho repo này.
zh_hans: 本仓库下还没有保存的会话。
zh_hant: 此倉庫尚無已儲存的對話。

# ai.assistant.chat.session.list.help
source: Show session list
ar: إظهار قائمة الجلسات
de: Sitzungsliste anzeigen
es: Mostrar lista de sesiones
fr: Afficher la liste des sessions
id: Tampilkan daftar sesi
it: Mostra elenco sessioni
ja: セッション一覧を表示
ko: 세션 목록 보기
nl: Toon sessielijst
pl: Pokaż listę sesji
pt_br: Mostrar lista de sessões
ru: Показать список сеансов
tr: Oturum listesini göster
uk: Показати список сеансів
vi: Hiện danh sách phiên
zh_hans: 查看会话列表
zh_hant: 顯示對話列表

# ai.assistant.chat.session.list.metaFormat
source: %lld msgs · %@
ar: %lld رسائل · %@
de: %lld Nachr. · %@
es: %lld mensajes · %@
id: %lld pst · %@
it: %lld msg · %@
ja: %lld メッセージ · %@
ko: %lld개 메시지 · %@
nl: %lld ber. · %@
pl: %lld wiad. · %@
ru: %lld сообщ. · %@
tr: %lld msj · %@
uk: %lld повід. · %@
vi: %lld tin nhắn · %@
zh_hans: %lld 条消息 · %@
zh_hant: %lld 則訊息 · %@

# ai.assistant.chat.session.list.title
source: Conversations
ar: المحادثات
de: Unterhaltungen
es: Conversaciones
id: Percakapan
it: Conversazioni
ja: 会話
ko: 대화
nl: Gesprekken
pl: Rozmowy
pt_br: Conversas
ru: Разговоры
tr: Konuşmalar
uk: Розмови
vi: Cuộc trò chuyện
zh_hans: 会话列表
zh_hant: 對話列表

# ai.assistant.chat.session.menu.help
source: More options
ar: خيارات إضافية
de: Weitere Optionen
es: Más opciones
fr: Plus d'options
id: Opsi lainnya
it: Altre opzioni
ja: その他のオプション
ko: 더 많은 옵션
nl: Meer opties
pl: Więcej opcji
pt_br: Mais opções
ru: Дополнительные параметры
tr: Diğer seçenekler
uk: Більше опцій
vi: Thêm tùy chọn
zh_hans: 更多操作
zh_hant: 更多選項

# ai.assistant.chat.session.new
source: New
ar: جديد
de: Neu
es: Nueva
fr: Nouveau
id: Baru
it: Nuova
ja: 新規
ko: 새로 만들기
nl: Nieuw
pl: Nowa
pt_br: Nova
ru: Новый
tr: Yeni
uk: Новий
vi: Mới
zh_hans: 新建
zh_hant: 新增

# ai.assistant.chat.session.new.help
source: Start a new conversation
ar: بدء محادثة جديدة
de: Neue Unterhaltung starten
es: Iniciar una nueva conversación
fr: Démarrer une nouvelle conversation
id: Mulai percakapan baru
it: Avvia una nuova conversazione
ja: 新しい会話を開始
ko: 새 대화 시작
nl: Start een nieuw gesprek
pl: Rozpocznij nową rozmowę
pt_br: Iniciar uma nova conversa
ru: Начать новый разговор
tr: Yeni bir konuşma başlat
uk: Почати нову розмову
vi: Bắt đầu cuộc trò chuyện mới
zh_hans: 新建对话
zh_hant: 開始新對話

# ai.assistant.chat.session.untitled
source: New conversation
ar: محادثة جديدة
de: Neue Unterhaltung
es: Nueva conversación
fr: Nouvelle conversation
id: Percakapan baru
it: Nuova conversazione
ja: 新しい会話
ko: 새 대화
nl: Nieuw gesprek
pl: Nowa rozmowa
pt_br: Nova conversa
ru: Новый разговор
tr: Yeni konuşma
uk: Нова розмова
vi: Cuộc trò chuyện mới
zh_hans: 新对话
zh_hant: 新對話

# ai.assistant.copy.copied
source: Copied ✓
ar: تم النسخ ✓
de: Kopiert ✓
es: Copiado ✓
fr: Copié ✓
id: Disalin ✓
it: Copiato ✓
ja: コピーしました ✓
ko: 복사됨 ✓
nl: Gekopieerd ✓
pl: Skopiowano ✓
pt_br: Copiado ✓
ru: Скопировано ✓
tr: Kopyalandı ✓
uk: Скопійовано ✓
vi: Đã sao chép ✓
zh_hans: 已复制 ✓
zh_hant: 已複製 ✓

# ai.assistant.inline.collapsed.help
source: Ask AI about the current repository
ar: اسأل الذكاء الاصطناعي عن المستودع الحالي
de: KI zum aktuellen Repository befragen
es: Preguntar a la IA sobre el repositorio actual
fr: Interroger l'IA sur le dépôt actuel
id: Tanya AI tentang repositori saat ini
it: Chiedi all'IA informazioni sul repository corrente
ja: 現在のリポジトリについてAIに質問
ko: 현재 저장소에 대해 AI에게 물어보기
nl: Vraag AI over de huidige repository
pl: Zapytaj AI o bieżące repozytorium
pt_br: Perguntar à IA sobre o repositório atual
ru: Спросить ИИ о текущем репозитории
tr: Geçerli depo hakkında AI'ya sor
uk: Запитати ШІ про поточний репозиторій
vi: Hỏi AI về repo hiện tại
zh_hans: 询问当前仓库
zh_hant: 詢問目前倉庫

# ai.assistant.inline.collapsed.title
source: Ask AI
ar: اسأل الذكاء الاصطناعي
de: KI fragen
es: Preguntar a la IA
fr: Interroger l'IA
id: Tanya AI
it: Chiedi all'IA
ja: AIに質問
ko: AI에게 물어보기
nl: Vraag AI
pl: Zapytaj AI
pt_br: Perguntar à IA
ru: Спросить ИИ
tr: AI'ya Sor
uk: Запитати ШІ
vi: Hỏi AI
zh_hans: 问 AI
zh_hant: 問 AI

# ai.assistant.inline.detach.help
source: Open in a separate window
ar: فتح في نافذة منفصلة
de: In einem separaten Fenster öffnen
es: Abrir en una ventana separada
fr: Ouvrir dans une fenêtre séparée
id: Buka di jendela terpisah
it: Apri in una finestra separata
ja: 別のウィンドウで開く
ko: 별도 창에서 열기
nl: Openen in apart venster
pl: Otwórz w osobnym oknie
pt_br: Abrir em uma janela separada
ru: Открыть в отдельном окне
tr: Ayrı bir pencerede aç
uk: Відкрити в окремому вікні
vi: Mở trong cửa sổ riêng
zh_hans: 在独立窗口中打开
zh_hant: 在獨立視窗中開啟

# ai.assistant.inline.resize.maximize.help
source: Expand within the detail pane
ar: توسيع داخل جزء التفاصيل
de: Im Detailbereich erweitern
es: Expandir en el panel de detalles
fr: Développer dans le volet de détail
id: Perluas di panel detail
it: Espandi nel pannello dei dettagli
ja: 詳細ペイン内で拡大
ko: 세부 정보 창 내에서 확장
nl: Uitvouwen in detailvenster
pl: Rozwiń w panelu szczegółów
pt_br: Expandir no painel de detalhes
ru: Развернуть в панели сведений
tr: Detay bölmesinde genişlet
uk: Розгорнути в панелі деталей
vi: Mở rộng trong khung chi tiết
zh_hans: 在详情页内放大
zh_hant: 在詳細面板內展開

# ai.assistant.inline.resize.restore.help
source: Restore compact size
ar: استعادة الحجم المضغوط
de: Kompakte Größe wiederherstellen
es: Restaurar tamaño compacto
fr: Restaurer la taille compacte
id: Kembalikan ukuran kompak
it: Ripristina dimensione compatta
ja: コンパクトサイズに戻す
ko: 작은 크기로 복원
nl: Compact formaat herstellen
pl: Przywróć kompaktowy rozmiar
pt_br: Restaurar tamanho compacto
ru: Восстановить компактный размер
tr: Kompakt boyuta döndür
uk: Відновити компактний розмір
vi: Khôi phục kích thước nhỏ gọn
zh_hans: 恢复紧凑尺寸
zh_hant: 恢復緊湊尺寸

# ai.assistant.input.contextMenu.anySearch
source: External docs (AnySearch)
ar: مستندات خارجية (AnySearch)
de: Externe Dokumente (AnySearch)
es: Documentación externa (AnySearch)
fr: Documentation externe (AnySearch)
id: Dokumen eksternal (AnySearch)
it: Documentazione esterna (AnySearch)
ja: 外部ドキュメント（AnySearch）
ko: 외부 문서 (AnySearch)
nl: Externe documentatie (AnySearch)
pl: Dokumentacja zewnętrzna (AnySearch)
pt_br: Documentação externa (AnySearch)
ru: Внешние документы (AnySearch)
tr: Harici dokümanlar (AnySearch)
uk: Зовнішня документація (AnySearch)
vi: Tài liệu ngoài (AnySearch)
zh_hans: 外部材料 (AnySearch)
zh_hant: 外部資料 (AnySearch)

# ai.assistant.input.contextMenu.anySearch.disabledHint
source: Enable AnySearch in Settings → Integrations first
ar: قم بتمكين AnySearch في الإعدادات ← التكاملات أولاً
de: Aktivieren Sie AnySearch zuerst in Einstellungen → Integrationen
es: Primero habilita AnySearch en Ajustes → Integraciones
fr: Activez d'abord AnySearch dans Réglages → Intégrations
id: Aktifkan AnySearch di Pengaturan → Integrasi terlebih dahulu
it: Abilita AnySearch in Impostazioni → Integrazioni prima
ja: 先に設定 → 連携でAnySearchを有効にしてください
ko: 설정 → 통합에서 먼저 AnySearch를 활성화하세요
nl: Schakel AnySearch eerst in via Instellingen → Integraties
pl: Najpierw włącz AnySearch w Ustawienia → Integracje
pt_br: Ative o AnySearch em Ajustes → Integrações primeiro
ru: Сначала включите AnySearch в Настройках → Интеграции
tr: Önce Ayarlar → Entegrasyonlar'da AnySearch'ü etkinleştirin
uk: Спочатку ввімкніть AnySearch у Налаштуваннях → Інтеграції
vi: Bật AnySearch trong Cài đặt → Tích hợp trước
zh_hans: 请先在 设置 → 集成 启用 AnySearch
zh_hant: 請先在「設定」→「整合」中啟用 AnySearch

# ai.assistant.input.contextMenu.codeContext
source: Code context
ar: سياق الكود
de: Code-Kontext
es: Contexto de código
fr: Contexte de code
id: Konteks kode
it: Contesto del codice
ja: コードコンテキスト
ko: 코드 컨텍스트
pl: Kontekst kodu
pt_br: Contexto do código
ru: Контекст кода
tr: Kod bağlamı
uk: Контекст коду
vi: Ngữ cảnh mã
zh_hans: 代码上下文
zh_hant: 程式碼上下文

# ai.assistant.input.contextMenu.help
source: Context options
ar: خيارات السياق
de: Kontextoptionen
es: Opciones de contexto
fr: Options de contexte
id: Opsi konteks
it: Opzioni di contesto
ja: コンテキストオプション
ko: 컨텍스트 옵션
nl: Contextopties
pl: Opcje kontekstu
pt_br: Opções de contexto
ru: Параметры контекста
tr: Bağlam seçenekleri
uk: Опції контексту
vi: Tùy chọn ngữ cảnh
zh_hans: 上下文配置
zh_hant: 上下文選項
